{
    "posts": [
        {
            "id": "connecting-with-your-inner-child",
            "title": "connecting with your inner child",
            "date": "May 2, 2023",
            "category": "Self-Compassion",
            "image": "../images/inner-child-blog.svg",
            "imageAlt": "Connecting with your inner child - therapy and self-compassion",
            "content": [
                {
                    "type": "paragraph",
                    "text": "I often tell my clients that anytime a strong emotion arises within them: that could be a sign that their inner child is being activated. For many of us fully-grown adults, the idea that an inner child lives within can be confusing. For me, I find the idea comforting because it normalizes and contextualizes the strong emotions that naturally come up for us in response to random or unexpected situations. The narrative can go from \"_I have no idea why I'm so upset!_\" to a more compassionate and empathic: \"_My inner child is expressing needs._\""
                },
                {
                    "type": "paragraph",
                    "text": "To imagine ourselves containing an inner child is complicated. Many folks have had painful and wounding experiences throughout their childhood- caregivers who did not respond compassionately, emotional neglect, abuse, bullying, etc. For those who have experienced any degree of pain in their childhood, it can be utterly confusing to imagine responding in a kind and loving way to those inner-child-activated emotions within themselves. However, I believe it is one the most powerful skills that leads towards a healed relationship with your self."
                },
                {
                    "type": "heading",
                    "text": "Here are some tips that I would offer to work towards this:"
                },
                {
                    "type": "subheading",
                    "text": "Simply validating the emotion."
                },
                {
                    "type": "paragraph",
                    "text": "We validate ourselves in many ways. Sometimes it is literally telling ourselves (in our heads or, better, out loud) \"_It's okay that I feel _____._\" We underestimate how powerful it can feel to be told that it is <em>okay</em> to feel an emotion. So many of us have received messages that it is NOT okay to feel sad, angry, frustrated, etc. This, in turn, has led many of us to have negative relationships with these emotions, perceiving them as bad or shameful. Emotions can't be controlled–therefore, the best thing we can do in response to them is to validate and allow them to run their course."
                },
                {
                    "type": "subheading",
                    "text": "Find the grey"
                },
                {
                    "type": "paragraph",
                    "text": "Children can have the endearing tendency to think in very rigid, inflexible ways. When adults do this, it can lead to damaging behavior and interpersonal dynamics. Strong emotions can lead us into all-or-nothing and black/white thinking, which in turn, can lead to even stronger and more painful emotions. To challenge this, I encourage \"finding the grey\" in our thoughts. This means to find the thought or action that might be more balanced and grounded, taking into account the two extreme sides in a situation. In DBT language, this would be called the \"wise mind\" part of ourselves."
                },
                {
                    "type": "subheading",
                    "text": "Doing something loving in response."
                },
                {
                    "type": "paragraph",
                    "text": "I find this tip extremely important, as it signifies a healing step that we may not have received when we were actual children. After validating the emotions we feel and challenging ourselves to find the grey, I highly encourage closing the loop with offering yourself a loving response. This might mean giving yourself a self-compassion break, treating yourself to a cup of tea, or opening yourself up to a much needed vulnerable conversation (with someone who is healthy enough to receive it). The last example is one I love- as it offers the possibility for a corrective emotional experience from another person as a secondary response to your inner child."
                },
                {
                    "type": "paragraph",
                    "text": "Clients frequently tell me that \"this feels forced\" or \"I just can't imagine treating myself this way.\" Much of therapy is about practicing skills that feel unfamiliar and <em>uncomfortable</em> to integrating it in a manner that feels intuitive and second-nature. From intellectual to heart. I will often use the analogy of starting physical exercise for the first time. That it might initially feel awkward, unnatural, or forced. However, feeling unfamiliar and uncomfortable aren't necessarily reasons to stop doing things that could be life-giving and healthy for ourselves. With that in mind, I encourage you to keep practicing the quiet muscle of connecting with your inner child as it will always be a part of you."
                }
            ]
        }
    ]
}